In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Customer.csv")
df

   custid custname        custname.1
0     123     ajay    ajay@gmail.com
1     124    rahul   rahul@gmail.com
2     125    pooja   pooja@yahoo.com
3     126  vishwas  guptav@gmail.com
4     127    aditi   aditi@gmail.com

In [3]:
df.rename({"custid":"Cust_id","custname":"Cust_name","custname.1":"Cust_Email"},axis=1,inplace=True)

In [4]:
df

   Cust_id Cust_name        Cust_Email
0      123      ajay    ajay@gmail.com
1      124     rahul   rahul@gmail.com
2      125     pooja   pooja@yahoo.com
3      126   vishwas  guptav@gmail.com
4      127     aditi   aditi@gmail.com

In [5]:
df.drop(["Cust_id"],axis="columns",inplace=True)
df

  Cust_name        Cust_Email
0      ajay    ajay@gmail.com
1     rahul   rahul@gmail.com
2     pooja   pooja@yahoo.com
3   vishwas  guptav@gmail.com
4     aditi   aditi@gmail.com

In [6]:
df

  Cust_name        Cust_Email
0      ajay    ajay@gmail.com
1     rahul   rahul@gmail.com
2     pooja   pooja@yahoo.com
3   vishwas  guptav@gmail.com
4     aditi   aditi@gmail.com

In [8]:
df["Mobile"]=[9878456589,9878456589,8878456589,8878456589,7878456589]

In [9]:
df

  Cust_name        Cust_Email      Mobile
0      ajay    ajay@gmail.com  9878456589
1     rahul   rahul@gmail.com  9878456589
2     pooja   pooja@yahoo.com  8878456589
3   vishwas  guptav@gmail.com  8878456589
4     aditi   aditi@gmail.com  7878456589